# for: 遍历字符串/元组/字典/数组
# 把所有的值都取出来
# a = "我是流经康，我的成绩是100E津巴布韦币"
# for i in a:
#     print(i)

# 遍历元组
# b = ("我","是","流","经","康","，","我","的","成","绩","是","1","0","0","E","津","巴","布","韦","币")
# for i in b:
#     print(i)

# 遍历list
# b = ["我","是","流","经","康","，","我","的","成","绩","是","1","0","0","E","津","巴","布","韦","币"]
# for i in b:
#     print(i)

# b = [(1,2,3),{"1":"2"},3]
# for i in b:
#     print(i)
#     print(i["1"])

# # 遍历字典
# c = {"刘经康":"100E津巴布韦币", "郭大侠":"100K$"}
# for i in c:
#     print(i)
#     print(c[i])
#     if 成绩 > 60:
#         添加到合格
#     else:
#         添加到不合格

# 打印和合格和不和

# 1. i = "刘经康"; c[i] 
# 2. i = "郭大侠" > c["郭大侠"] > c[i]


# 作业：请把成绩>60的小伙伴分到一个list中，不合格的分到另外一个list中，for来做。
# hege = ["郭大侠", "王权"]
# buhege = ["刘经康", "雷仪"]
grade = {"刘经康":58, "郭大侠":90, "王泉":88, "雷仪":99}
# 一系列操作
hege = [] # 内容为合格的空list
buhege = [] # 内容为不合格的空list
# 每个人的成绩和姓名取出来：遍历
for i in grade:
    # 判断每个分数
    # 如果分数大于60，就存到合格的list中
    if grade[i] >= 60:
        hege.append(i)
    else:                       # 否则不合格，存在不合格的list中
        buhege.append(i)

# 打印合格和不合格
print(hege)
print(buhege)